alert('Добрий день ! Вітаю ДВОХ та ЛИШЕ двох гравців у чудовій, неповторній грі КАМІНЬ-НОЖИЦІ-ПАПІР - хто переможе - той ПЕРЕМОЖЕЦЬ!');
alert('Отже правила наступні - цифра - 1 то камінь, тупить та перемагає ножиці але загортається і програє паперу'); 
alert('Друге правило - цифра - 2 то ножиці, ріжуть вщент папір але тупляться каменем'); 
alert('Третє правил - цифра 3 - то папір, який піддатливий ножицям але блокує камінь, взважте це !'); 
alert('і мабудь найголовніше - лише три спроби у Вас є ! ЛИШЕ! тому не зволікайте)))) і думайте!'); 
alert('Якщо Ви готові?! а Ви готові!  То почнемо!'); 


let sprob = 3; // кількість раундів
let i1 = 0; // підрахунок перемог 1 гравця
let i2 = 0; // підрахунок перемог 2 гравця
let tutu = 0; // підрахунок спроб
let varGra1; // значення ходу гравця кожен раунд - переобновляється
let varGra2; // значення ходу гравця кожен раунд - переобновляється

for ( let i = 0; i < sprob; i++) {

    console.log(i);
    varGra1 = prompt('Отже ПЕРШИЙ гравець має визначити свій хід - 1 то камінь , 2 то ножиці, 3 - то папір... і  кожен хід то крок до перемоги чи загибелі...  ');
    varGra2 = prompt('Тепер Другий гравець має визначити свій хід - 1 то камінь , 2 то ножиці, 3 - то папір... і  кожен хід то крок до перемоги чи загибелі...  ');
    if ((varGra1 < 0 || varGra1 > 3) || (varGra2 < 0 || varGra2 > 3)) {
        console.log('НЕ Зараховано, спроба Не вдалася');
    } 

    tutu++ ; 

    if ( varGra1 == 1 & varGra2 == 2 ){
        i1++;
        console.log('Переміг перший гравець')
    } else if ( varGra1 == 2 & varGra2 == 3 ){
        console.log('Переміг перший гравець')
        i1++;
    } else if ( varGra1 == 3 & varGra2 == 1 ){
        console.log('Переміг перший гравець')
        i1++;
    } else if ( varGra1 == 1 & varGra2 == 3 ){
        console.log('Переміг другий гравець')
        i2++;
    } else if ( varGra1 == 3 & varGra2 == 2 ){
        console.log('Переміг другий гравець')
        i2++;
    } else if ( varGra1 == 2 & varGra2 == 1 ){
        console.log('Переміг другий гравець')
        i2++;
    } 
}

if (i1 > i2) {
    console.log('Гра кінчена!  Переміг перший гравець');
    
} else if (i1 < i2) {
    console.log('Гра кінчена!  Переміг ДРУГий гравець');
    
} 


